import * as React from "react";
import Typography from "@mui/material/Typography";
import { motion } from "framer-motion";
import { Container, Divider, Grid } from "@mui/material";

export default function AboutUs() {
  return (
    <motion.div
      initial={{ opacity: 0, width: 0 }}
      animate={{ opacity: 1, width: "100%" }}
      exit={{ opacity: 0, width: 0 }}
    >
      <Container maxWidth="md">
        <Typography sx={{ textAlign: "center" }} variant="h2" gutterBottom>
          راهنمای مبادله
        </Typography>
        <Typography>
          <>
            <h2>
              <span>مبدل</span>
            </h2>
            <p>
              ۱. این کلید برای به‌روزرسانی نرخ قیمت به‌صورت دستی است، همچنین نرخ
              قیمت به‌صورت پیش‌فرض هر ۳۰ ثانیه یکبار در نرخ شناور و ۲ دقیقه
              یکبار در نرخ ثابت به‌روزرسانی می‌شود.
              <br />
              ۲.کلید ورود به راهنمای مبادله.
              <br />
              ۳.کلید اتصال کیف پول شخصی کاربر به دکسها برای انجام مبادلات
              از طریق پروتکل ولت کانکت
              <br />
              ۴.کلید مبادله با نرخ ثابت که با انتخاب این بخش می‌توانید با نرخ
              ثابت مبادلات خود را انجام دهید.
              <br />
              ۵.کلید مبادله با نرخ شناور که با انتخاب این بخش می‌توانید با نرخ
              لحظه‌ای مبادلات خود را انجام دهید.
              <br />
              ۶.مقدار رمز ارزی که می‌خواهید تبدیل و واریز نمایید را از این قسمت
              تعیین کنید.
              <br />
              ۷.نوع و شبکه رمزارزی را که برای تبدیل می‌خواهید واریز کنید را از
              این قسمت انتخاب نمایید
              <br />
              ۸.مقدار رمزارزی که بعد از تکمیل مبادله دریافت خواهید کرد.
              <br />
              ۹.نوع و شبکه رمزارزی که برای تبدیل می‌خواهید دریافت کنید را از این
              قسمت انتخاب نمایید.
              <br />
              ۱۰.مقدار کارمزد مبادله را در این قسمت می‌توانید مشاهده کنید.
              <br />
              ۱۱.دکمه شروع مبادله
            </p>
            <p></p>
            <h3>
              <span>ورود آدرس‌های ولت</span>
            </h3>
            <p>
              ۱.قبل از ادامه مبادله، ابتدا مطمئن شوید در این آدرس هستید
              <br />
              ۲.آدرس کیف پولی که می‌خواهید مقدار مبادله شده به آن واریز شود را
              در این کادر وارد نمایید.
              <br />
              ۳.اگر بعد از پرداخت رمزارز توسط شما، به هر دلیلی مبادله تکمیل نشود
              و یا لغو گردد، مقدار رمزارزی را که پرداخت کرده‌اید به این آدرس
              بازپرداخت می‌شود.
            </p>
            <h3>
              <br />
              <span>تأیید جزئیات مبادله</span>
            </h3>
            <p>
              ۱.بعد از تکمیل تبادل، رمزارز دریافتی شما به این آدرس واریز می‌گردد
              که در مرحله قبل خودتان ثبت نمودید.
              <br />
              ۲.آدرس بازپرداختی که خودتان در مرحله قبل ثبت نمودید.
              <br />
              ۳.نوع مبادله با نرخ ثابت یا شناور را مشخص می‌کند.
              <br />
              ۴.زمان حدودی تکمیل تبادل را نشان می‌دهد.
              <br />
              ۵.مقدار دریافتی شما بعد از تکمیل تبادل را نشان می‌دهد.
              <br />
              ۶.دکمه تأیید جزئیات مبادله
              <br />
              ۷.لینک محتوای قوانین و مقررات
            </p>
            <h3>
              <br />
              <span>توضیحات تکمیل مبادله</span>
            </h3>
            <p>
              ۱.برای تکمیل تبادل، کاربر باید مقدار رمزارزی را که مشخص کرده، به
              آدرسی که برای این مبادله ایجاد شده، به‌صورت مستقیم یا از طریق
              اتصال کیف پول به ولت کانکت واریز نماید.
              <br />
              ۲.برای تکمیل تبادل می‌توانید از طریق انتخاب دکمه ولت کانکت اقدام
              نمایید.
              <br />
              ۳.این کد برای پیگیری مبادلات در دکسها است. در صورت درخواست
              پیگیری مبادلات خود، این کد پیگیری را برای کارشناسان پشتیبان ما از
              طریق چت آنلاین ارسال نمایید.
              <br />
              ۴.این قسمت وضعیت مبادله شما را نشان می‌دهد، تا زمانی که رمزارز
              موردنظر را برای تبادل به آدرس ایجاد شده ارسال نکرده باشید وضعیت
              مبادله شما در انتظار واریز است.
              <br />
              ۵.بعد از واریز رمزارز مشخص شده توسط شما و تایید در شبکه بلاکچین،
              وضعیت مبادله به تایید واریز و تبادل تغییر می‌کند.
              <br />
              ۶.بعد از انجام تبادل و ارسال رمزارزهای تبدیل شده به آدرس کیف پول
              شما، وضعیت مبادله به حالت ارسال برای شما و صدور فاکتور تغییر
              می‌کند.
            </p>
            <p></p>
            <h3>
              <span>مبادله با نرخ شناور</span>
            </h3>
            <p>
              <strong>
                مرحله اول: انتخاب نوع و مقدار رمزارزهای موردنظر به را تبادل با
                نرخ شناور
              </strong>
            </p>
            <p>
              ۱.ابتدا نوع رمز ارزی را که می‌خواهید واریز و دریافت نمایید از لیست
              رمزارزها انتخاب کنید.
            </p>
            <p>
              ۲.سپس مقدار رمزارزی را که می‌خواهید برای تبدیل واریز نمایید، در
              کادر مشخص شده وارد کنید.
            </p>
            <p>۳.بعد از انجام موارد ۱ و ۲ دکمه شروع مبادله را انتخاب کنید.</p>
            <p></p>
            <p>
              <strong>
                مرحله دوم: واردکردن آدرس دریافت رمزارز و بازپرداخت
              </strong>
            </p>
            <p>
              ۱.در این مرحله، آدرس کیف پولی که می‌خواهید رمزارز تبادل شده به آن
              واریز شود، در کادر موردنظر وارد نمایید
            </p>
            <p>
              ۲.بعد از واردکردن آدرس کیف پول دریافت‌کننده، کادر آدرس بازپرداخت
              نمایان می‌شود که در این کادر باید آدرس کیف پولی را وارد کنید که
              اگر به هر دلیلی مبادله شما انجام نشد مقدار رمزارزی که واریز
              کرده‌اید به این آدرس بازپرداخت شود (واردکردن آدرس بازپرداخت
              اختیاری است).
            </p>
            <p>
              ۳.بعد از وارد نمودن آدرس‌های کیف پول، دکمه مرحله بعد را انتخاب
              کنید.
            </p>
            <p></p>
            <p>
              <strong>مرحله سوم: تأیید جزئیات مبادله</strong>
            </p>
            <p>
              ۱.در این مرحله جزئیات مبادله خود را به‌دقت بررسی کنید و بعد از
              اطمینان از صحت اطلاعات وارد شده، دکمه تأیید جزئیات مبادله را کلیک
              کنید.
            </p>
            <p></p>
            <p>
              <strong>مرحله چهارم : تکمیل تبادل</strong>
            </p>
            <p>
              ۱.برای تکمیل تبادل می‌بایست دقیقا مقدار رمزارزی را که مشخص
              نموده‌اید به آدرسی که برایتان ایجاد کرده‌ایم واریز کرده و منتظر
              تأیید واریز بمانید. واریز رمزارز به ۲ طریق امکان‌پذیر است، راه
              اول، رمزارز را به طور مستقیم از ولت شخصی و یا صرافی خود واریز
              نمایید، راه دوم می‌توانید از طریق اتصال کیف پول شخصی به ولت کانکت
              و ارسال اسمارت کانترکت به کیف پول خودتان، واریز و تبادل را انجام
              دهید.
            </p>
            <p>
              ۲.توجه نمایید در مبادله با نرخ شناور، دریافتی نهایی شما ممکن است
              بیشتر یا کمتر از مقدار نمایش‌داده‌شده در ابتدای مبادله باشد و
              نوسان قیمت روی دریافت نهایی شما تأثیر بگذارد.
            </p>
            <p></p>
            <h3>
              <span>مبادله با نرخ ثابت</span>
            </h3>
            <p>
              فرایند تبادل با نرخ ثابت دقیقا مشابه با تبادل با نرخ شناور است، با
              این تفاوت که مقدار رمزارز دریافتی نهایی شما، با نرخ مشخص شده در
              ابتدای ایجاد تبادل برابر است و شما دقیقا همان مقدار مشخص شده در
              ابتدای تبادل را دریافت خواهید کرد و نوسان قیمت رمزارزها تاثیری در
              دریافتی نهایی شما ندارد.
            </p>
            <h3>
              <span>
                مبادله از طریق ولت کانکت
                <br />
              </span>
            </h3>
            <p>
              <strong>مرحله اول :</strong>
            </p>
            <p>۱.ابتدا نوع و مقدار رمزارز را برای تبادل در مبدل انتخاب کنید</p>
            <p>
              ۲.بعد از انتخاب نوع و مقدار رمزارز، دکمه ولت کانکت را کلیک کنید.
            </p>
            <p></p>
            <p>
              <strong>مرحله دوم :</strong>
            </p>
            <p>
              ۱.در این مرحله یک QR کد برای اتصال به کیف پول به شما نمایش می‌دهیم
              که از طریق ولت شخصی (به طور مثال: تراست ولت) می‌توانید کیف پول
              شخصی خود را به دکسها متصل نمایید. برای این کار باید در قسمت
              setting کیف پولتان، گزینه WalletConnect را کلیک کرده و بارکدی که
              به شما نمایش داده‌ایم را اسکن کرده و در کیف پولتان اتصال را تأیید
              نمایید.
            </p>
            <p>
              ۲.توجه: دکسها هیچ‌گونه دسترسی به موجودی و یا کدهای بک‌آپ
              کیف پول شما ندارد.
            </p>
            <p></p>
            <p>
              <strong>مرحله سوم :</strong>
            </p>
            <p>
              ۱.وارد کردن آدرس دریافت رمزارز و بازپرداخت (مانند آموزش مبادله با
              نرخ شناور)
            </p>
            <p></p>
            <p>
              <strong>مرحله چهارم :</strong>
            </p>
            <p>۱.تایید جزئیات مبادله (مانند آموزش مبادله با نرخ شناور)</p>
            <p></p>
            <p>
              <strong>مرحله پنجم :</strong>
            </p>
            <p>
              ۱.در این مرحله اگر قبل از شروع تبادل، کیف پول خود را از طریق ولت
              کانکت به دکسها متصل کرده‌ باشید، می‌توانید دکمه ارسال
              تراکنش به ولت را کلیک کرده و در این صورت تراکنش به کیف پول شخصیتان
              ارسال خواهد شد. در این مرحله باید کیف پول خود را بازکرده و تراکنش
              را تایید نمایید، توجه داشته باشید برای ارسال تراکنش باید کارمزد
              شبکه انتقال در کیف پولتان موجود باشد در غیر این صورت تراکنش انجام
              نمی‌شود. بعد از تایید تراکنش منتظر تکمیل و ارسال رمزارز تبدیل شده
              به کیف پولتان بمانید.
            </p>
          </>
        </Typography>
      </Container>
    </motion.div>
  );
}
